RhinoInside.Revit API Documentation
GeometryDecoder.ToBoundingBox Method (BoundingBoxXYZ, Transform)
 Converts the specified Autodesk.Revit.DB.BoundingBoxXYZ to an equivalent Rhino.Geometry.BoundingBox and outputs the conversion transform.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Rhino.Geometry.BoundingBox ToBoundingBox(
	this Autodesk.Revit.DB.BoundingBoxXYZ boundingBox,
	out Rhino.Geometry.Transform transform
)
@staticmethod
def ToBoundingBox(
	boundingBox: Autodesk.Revit.DB.BoundingBoxXYZ,
) -> (Rhino.Geometry.BoundingBox,,)
Parameters
boundingBox
Type: Autodesk.Revit.DB.BoundingBoxXYZ
Revit boundingBox to convert.
transform
Type: Rhino.Geometry.Transform
Conversion transform as output.
Return Value
Type: Rhino.Geometry.BoundingBox
Rhino boundingBox that is equivalent to the provided Revit boundingBox.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.BoundingBoxXYZ. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToBoundingBox(BoundingBoxXYZ) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
BoundingBox rhinoBBox = revitBBox.ToBoundingBox(out var Transform transform);
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_bbox: BoundingBox, transform = revit_bbox.ToBoundingBox() # type: RG.Transform
 Using ToBoundingBox(BoundingBoxXYZ) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
BoundingBox rhinoBBox = GeometryEncoder.ToBoundingBox(revitBBox, out var Transform transform)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_bbox: BoundingBox, transform = GD.ToBoundingBox(revit_bbox) # type: RG.Transform
See Also
Reference
GeometryDecoder Class
ToBoundingBox Overload
RhinoInside.Revit.Convert.Geometry Namespace